docs(readme): switch to ascii architecture diagram
